// Напишите программу, которая на вход принимает число и выдаёт, 
//является ли число чётным (делится ли оно на два без остатка).
int a;
Console.WriteLine("Введите число: ");
a= Console.Read ();
if (a % 2 == 1) 
{
                      Console.WriteLine("число N нечетное");
}
else
{
                      Console.WriteLine("число N четное");
}