// Задача 2: Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.

int a = 5;
int b = 7;
if (a > b)
{
     //Console.WriteLine("число a max, число b min");
     Console.WriteLine($" {a} - max,  {b} - min");                   
}
else if (a < b )
{
   //Console.WriteLine("число a min, число b max"); 
   Console.WriteLine($" {a} - min,  {b} - max");                  
}
