// Задача 8: Напишите программу, которая на вход принимает число (N), 
//а на выходе показывает все чётные числа от 1 до N.

int N;
int bank = 1;
Console.WriteLine("Введите число: ");
N = Console.Read ();
while ()